#Задайте список из нескольких чисел. 
#Напишите программу, которая найдёт сумму 
#элементов списка, стоящих на нечётной позиции.

#Пример:

#    - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


lst = [2, 5, 7, 12, 34]
sum = 0
if len(lst) % 2 == 0:
    for i in range(1,len(lst)-1,2):
        sum += lst[i]
elif len(lst) % 2 != 0:
    for i in range(1,len(lst),2):
        sum += lst[i]
print (sum)
